parser = '''as
1. …처럼2. …으로서3. …하면서
미국 [əz, ǽz]	듣기 영국 [əz, ǽz]	듣기
and
1. … 및 …2. 그리고3. …하고4. 또
미국 [ənd, ən, nd, n; (p,b,m뒤)m; (k,g,ŋ뒤)ŋ]	듣기 영국 [ənd, ən, nd, n; (p,b,m뒤)m; (k,g,ŋ뒤)ŋ]	듣기
all
1. 모든2. 모두3. 다4. 전부5. 전체
미국 [ɔːl]	듣기 영국 [ɔːl]	듣기
about
1. …에 대하여2. 약…3. 정도4. 좀5. 거의
미국 [əbáut]	듣기 영국 [əbáut]	듣기
at
1. …에2. …으로3. …에서
미국 [ət; (강) ǽt, ӕt]	듣기 영국 [ət; (강) ǽt, ӕt]	듣기
act
1. 행동하다2. 법률3. 연기하다4. 행위5. 대행하다
미국 [ækt]	듣기 영국 [ækt]	듣기
after
1. …후에2. …뒤에3. 다음의4. 그 후5. 나중에
미국 [ǽftər]	듣기 영국 [άːftər]	듣기
arm
1. 팔2. 무기3. 무장하다4. 부문5. 팔걸이
미국 [aːrm]	듣기 영국 [aːrm]	듣기
answer
1. 답하다2. 대답3. 해답4. 전화를 받다5. 응답하다
미국 [ǽnsər]	듣기 영국 [άːnsər]	듣기
air
1. 공기2. 대기3. 항공의4. 공군의5. 하늘의
미국 [εər]	듣기 영국 [εər]	듣기
age
1. 나이2. 시대3. 노인들4. 오래되다5. 오랫동안
미국 [eidʒ]	듣기 영국 [eidʒ]	듣기
away
1. 떨어져2. 멀리3. 떠나4. 당장5. 사라져
미국 [əwéi]	듣기 영국 [əwéi]	듣기
attack
1. 공격하다2. 발작3. 비난하다4. 덤벼들다5. 폭행하다
미국 [ətǽk]	듣기 영국 [ətǽk]	듣기
ask
1. 묻다2. 요청하다3. 질문하다4. 부탁하다5. 말씀하다
미국 [æsk]	듣기 영국 [aːsk]	듣기
affair
1. 문제2. 일3. 사건4. 정사5. 행사
미국 [əfέər]	듣기 영국 [əfέər]	듣기
around
1. 주변에2. 주위에3. 돌아다니는4. 근처에
미국 [əráund]	듣기 영국 [əráund]	듣기
above
1. 위에2. 이상인3. 하늘에4. 상기(上記)한
미국 [əbΛv]	듣기 영국 [əbΛv]	듣기
any
1. 어떤2. 전혀3. 아무4. 어느5. 누군가
미국 [əni,(강) éni]	듣기 영국 [əni,(강) éni]	듣기
aim
1. 목표2. 목적3. 겨냥하다4. 노리다5. 조준하다
미국 [eim]	듣기 영국 [eim]	듣기
area
1. 지역2. 분야3. 영역4. 면적5. 지방
미국 [έəriə]	듣기 영국 [έəriə]	듣기
against
1. …에 대한2. 반대로3. 대항하여4. 반하는5. 기대어서
미국 [əgénst, əgéinst]	듣기 영국 [əgénst, əgéinst]	듣기
address
1. 주소2. 연설하다3. 해결하다4. 이야기하다5. 부르다
미국 [ədrés, ǽdres｜ədrés]	듣기 영국 [ədrés, ǽdres｜ədrés]	듣기
admit
1. 인정하다2. 시인하다3. 입원시키다4. 허가하다5. 승인하다
미국 [ædmít]	듣기 영국 [ədmít]	듣기
argue
1. 주장하다2. 논쟁하다3. 논의하다4. 말다툼하다5. 왈가왈부하다
미국 [άːrgjuː]	듣기 영국 [άːrgjuː]	듣기
advice
1. 조언2. 충고3. 도움4. 권고5. 지시
미국 [ædváis]	듣기 영국 [ədváis]	듣기
agree
1. 동의하다2. 합의하다3. 일치하다4. 승낙하다5. 제안에 응하다
미국 [əgríː]	듣기 영국 [əgríː]	듣기
attend
1. 참석하다2. 다니다3. 주의하다4. 돌보다
미국 [əténd]	듣기 영국 [əténd]	듣기
attempt
1. 시도하다2. 노력3. 기도하다4. 계획하다5. 미수
미국 [ətémpt]	듣기 영국 [ətémpt]	듣기
among
1. …중에2. 대한3. 상호간에4. …사이에5. 가운데
미국 [əmΛŋ]	듣기 영국 [əmΛŋ]	듣기
accident
1. 사고2. 교통사고3. 재난4. 우연한 사고5. 사건
미국 [ǽksidənt]	듣기 영국 [ǽksidənt]	듣기
along
1. 함께2. …을 따라3. 동안에4. 가지고5. 계속
미국 [əlɔ́ːŋ]	듣기 영국 [əlɔ́ŋ]	듣기
angry
1. 화난2. 성난3. 격렬한
미국 [ǽŋgri]	듣기 영국 [ǽŋgri]	듣기
alone
1. 혼자2. 홀로3. 다만 …뿐이다4. 고립하여
미국 [əlóun]	듣기 영국 [əlóun]	듣기
animal
1. 동물2. 짐승3. 야수
미국 [ǽnəməl]	듣기 영국 [ǽnəməl]	듣기
allow
1. …할 수 있게 하다2. 허용하다3. 허락하다
미국 [əláu]	듣기 영국 [əláu]	듣기
accept
1. 받아들이다2. 수용하다3. 인정하다4. 입학시키다5. 응하다
미국 [æksépt]	듣기 영국 [æksépt]	듣기
another
1. 다른2. 또3. 하나4. 더5. 다시
미국 [ənΛðər]	듣기 영국 [ənΛðər]	듣기
alive
1. 살아 있는2. 생기에 넘치는3. 이 세상의4. 계속하여5. 생생한
미국 [əláiv]	듣기 영국 [əláiv]	듣기
awake
1. 깨다2. 잠에서 깨다3. 깨어나다
미국 [əwéik]	듣기 영국 [əwéik]	듣기
almost
1. 거의2. 대부분3. 약4. …에 가까운5. 하마터면
미국 [ɔ́ːlmoust]	듣기 영국 듣기
appear
1. 나타나다2. …처럼 보이다3. 출연하다4. …인 듯하다5. 생기다
미국 [əpíər]	듣기 영국 [əpíər]	듣기
afraid
1. 두려운2. 무서워하여3. 걱정인4. 것 같다5. 미안하지만
미국 [əfréid]	듣기 영국 [əfréid]	듣기
able
1. …할 수 있는2. 유능한3. 자격 있는4. 수완 있는
미국 [éibl]	듣기 영국 [éibl]	듣기
arrive
1. 도착하다2. 오다3. 가다4. 도래하다5. 도달하다
미국 [əráiv]	듣기 영국 [əráiv]	듣기
anxious
1. 불안한2. 하고 싶어하는3. 걱정스러운
미국 [ǽŋkʃəs]	듣기 영국 [ǽŋkʃəs]	듣기
afternoon
1. 오후2. 점심
미국 [æˌftərnuˈn]	듣기 영국 [æˌftərnuˈn]	듣기
across
1. … 전역에서2. 가로질러서3. 걸쳐서4. 건너다5. 지름으로
미국 [əkrɔ́ːs, əkrάs]	듣기 영국 [əkrɔ́s]	듣기
anything
1. 무엇이든2. 어느 것이든3. 아무것도4. 조금이라도
미국 [éniθìŋ]	듣기 영국 [éniθìŋ]	듣기
again
1. 다시2. 또3. 다시 한 번
미국 [əgén, əgéin]	듣기 영국 [əgén, əgéin]	듣기
advise
1. 조언하다2. 권하다3. 알리다4. …하는 게 좋다5. 상담하다
미국 [ædváiz]	듣기 영국 [ədváiz]	듣기
avoid
1. 피하다2. 회피하다3. 막다4. 자제하다5. 예방하다
미국 [əvɔ́id]	듣기 영국 [əvɔ́id]	듣기
all right
1. 좋아2. 알았어3. 괜찮아4. 자5. 무사한
미국 듣기 영국 듣기
always
1. 항상2. 언제나3. 늘4. 반드시5. 줄곧
미국 [ɔ́ːlweiz, -wiːz]	듣기 영국 [ɔ́ːlweiz, -wiːz]	듣기
apple
1. 애플2. 사과3. 사과나무4. 뉴욕
미국 [ǽpl]	듣기 영국 [ǽpl]	듣기
assist
1. 돕다2. 보조3. 지원하다4. 어시스트5. 조력하다
미국 [əsíst]	듣기 영국 [əsíst]	듣기
anybody
1. 이렇다할 사람2. 누군가3. 아무나
미국 [énibὰdi, énibΛdi]	듣기 영국 [énibɔ̀di]	듣기
anyone
1. 누군가2. 모든 사람3. 아무도
미국 [éniwΛn, -wən]	듣기 영국 [éniwΛn, -wən]	듣기
an
부정관사 a
미국 [ən; ǽn]	듣기 영국 [ən; ǽn]	듣기
ago
1. 전2. 지난3. 이전4. 전년5. 오래전에
미국 [əgóu]	듣기 영국 [əgóu]	듣기
add
1. 덧붙이다2. 더하다3. 추가하다4. 포함시키다5. 증가하다
미국 [æd]	듣기 영국 [æd]	듣기
asleep
1. 잠들어2. 자는3. 조는
미국 [əslíːp]	듣기 영국 [əslíːp]	듣기
already
1. 이미2. 벌써3. 충분히4. 이전에5. 지금까지
미국 [ɔːlrédi]	듣기 영국 [ɔːlrédi]	듣기
achieve
1. 달성하다2. 성취하다3. …을 이루다4. 획득하다
미국 [əʧíːv]	듣기 영국 [əʧíːv]	듣기
alike
1. 똑같이2. 모두3. 비슷한4. 한결같이
미국 [əláik]	듣기 영국 [əláik]	듣기
also
1. 또한2. 역시3. 뿐만 아니라4. 마찬가지로5. 게다가
미국 [ɔ́ːlsou]	듣기 영국 [ɔ́ːlsou]	듣기
am
1. be의 1인칭·단수·직설법·현재형2. 오전
미국 [əm, (강) ǽm]	듣기 영국 [əm, (강) ǽm]	듣기
american
1. 미국인2. 미국의3. 아메리카의4. 아메리칸5. 미국적인
미국 [əmérikən]	듣기 영국 [əmérikən]	듣기
autumn
가을
미국 [ɔ́ːtəm]	듣기 영국 [ɔ́ːtəm]	듣기
account
1. 회계2. 차지하다3. 계좌4. 말5. 보고
미국 [əkáunt]	듣기 영국 [əkáunt]	듣기
action
1. 행동2. 전투3. 액션4. 효과5. 소송
미국 [ǽkʃən]	듣기 영국 [ǽkʃən]	듣기
advance
1. 발전2. 진출3. 진보4. 발달5. 나아가다
미국 [ædvǽns]	듣기 영국 [ədvάːns]	듣기
art
1. 예술2. 미술품3. 미술4. 아트5. 기술
미국 [aːrt]	듣기 영국 [aːrt]	듣기
authority
1. 당국2. 권한3. 권위4. 권위자5. 권력
미국 [əθɔ́ːrəti, əθάrəti]	듣기 영국 [ɔːθɔ́rəti]	듣기
appeal
1. 호소2. 매력3. 항소4. 마음에 들다5. 상고
미국 [əpíːl]	듣기 영국 [əpíːl]	듣기
active
1. 능동적인2. 활동적인3. 적극적인4. 활발한5. 현역의
미국 [ǽktiv]	듣기 영국 [ǽktiv]	듣기
attention
1. 관심2. 주의력3. 주의4. 주목5. 집중
미국 [əténʃən]	듣기 영국 [əténʃən]	듣기
aid
1. 지원2. 원조3. 도움4. 구호5. 보조
미국 [eid]	듣기 영국 [eid]	듣기
article
1. 논문2. 기사3. 조항4. 물건5. 관사
미국 [άːrtikl]	듣기 영국 [άːrtikl]	듣기
approach
1. 접근하다2. 접근법3. 방법4. 다가오다5. 도달하다
미국 [əpróuʧ]	듣기 영국 [əpróuʧ]	듣기
arrangement
1. 배열2. 합의3. 계약4. 계획5. 준비
미국 [əréindʒmənt]	듣기 영국 [əréindʒmənt]	듣기
appearance
1. 외모2. 출연3. 겉모습4. 출전5. 출석
미국 [əpíərəns]	듣기 영국 [əpíərəns]	듣기
argument
1. 주장2. 논쟁3. 말다툼4. 논점5. 논거
미국 [άːrgjumənt]	듣기 영국 [άːrgjumənt]	듣기
ability
1. 능력2. 수 있다3. 력4. 기능5. 재능
미국 [əbíləti]	듣기 영국 [əbíləti]	듣기
august
8월
미국 [ɔ́ːgəst]	듣기 영국 [ɔ́ːgəst]	듣기
alternative
1. 대안2. 대체3. 대신의4. 다른5. 얼터너티브
미국 [ɔːltə́ːrnətiv, æltə́ːrnətiv]	듣기 영국 [ɔːltə́ːrnətiv]	듣기
apply
1. 적용하다2. 지원하다3. 신청하다4. 응용하다5. 바르다
미국 [əplái]	듣기 영국 [əplái]	듣기
audience
1. 관객2. 청중3. 관중4. 시청자5. 독자
미국 [ɔ́ːdiəns]	듣기 영국 [ɔ́ːdiəns]	듣기
amount
1. 양2. 되다3. 금액4. 달하다5. 액수
미국 [əmáunt]	듣기 영국 [əmáunt]	듣기
angle
1. 각도2. 관점3. 모서리
미국 [ǽŋgl]	듣기 영국 [ǽŋgl]	듣기
acquaintance
1. 아는 사람2. 인물3. 친지4. 만남
미국 [əkwéintəns]	듣기 영국 [əkwéintəns]	듣기
agreement
1. 합의2. 협정3. 동의4. 계약5. 조화
미국 [əgríːmənt]	듣기 영국 [əgríːmənt]	듣기
assume
1. 가정하다2. 생각하다3. 추측하다4. 추정하다5. 맡다
미국 [əsúːm]	듣기 영국 [əsjúːm]	듣기
arrange
1. 배치하다2. 준비하다3. 마련하다4. 정리하다5. 계획하다
미국 [əréindʒ]	듣기 영국 [əréindʒ]	듣기
awkward
1. 어색한2. 거북한3. 서투른4. 곤란한5. 난처한
미국 [ɔ́ːkwərd]	듣기 영국 [ɔ́ːkwərd]	듣기
average
1. 평균2. 보통의
미국 [ǽvəridʒ]	듣기 영국 [ǽvəridʒ]	듣기
appreciate
1. 알아주다2. 감사하다3. 감상하다4. 고마워하다5. 인정하다
미국 [əpríːʃièit]	듣기 영국 [əpríːʃièit]	듣기
affect
1. 영향을 주다2. 작용하다3. 감염시키다4. …체하다
미국 [əfékt]	듣기 영국 [əfékt]	듣기
agent
1. 에이전트2. 요원3. 대리인4. 첩보원5. 행위자
미국 [éidʒənt]	듣기 영국 [éidʒənt]	듣기
activity
1. 활동2. 활성3. 행위4. 레저5. 기능
미국 [æktívəti]	듣기 영국 [æktívəti]	듣기
attitude
1. 태도2. 자세3. 행동4. 의식5. 관점
미국 [ǽtitjùːd]	듣기 영국 [ǽtitjùːd]	듣기
aware
1. 알고 있는2. 인식하는3. 깨달은4. 의식하는
미국 [əwέər]	듣기 영국 [əwέər]	듣기
admission
1. 입학2. 입장3. 입원4. 인정5. 승인
미국 [ædmíʃən]	듣기 영국 [ədmíʃən]	듣기
approval
1. 승인2. 허가3. 동의4. 찬성
미국 [əprúːvəl]	듣기 영국 [əprúːvəl]	듣기
army
1. 군2. 군대3. 육군
미국 [άːrmi]	듣기 영국 [άːrmi]	듣기
available
1. 가능한2. 이용할 수 있는3. 유효한4. 유용한5. 시간이 있는
미국 [əvéiləbl]	듣기 영국 [əvéiləbl]	듣기
absence
1. 없음2. 부족3. 결석4. 공백
미국 [ǽbsəns]	듣기 영국 [ǽbsəns]	듣기
appointment
1. 임명2. 약속3. 예약
미국 [əpɔ́intmənt]	듣기 영국 [əpɔ́intmənt]	듣기
aspect
1. 양상2. 측면3. ~면4. 관점5. 국면
미국 [ǽspekt]	듣기 영국 [ǽspekt]	듣기
advantage
1. 이점2. 우위3. 유리4. 이익5. 혜택
미국 [ædvǽntidʒ]	듣기 영국 [ədvάːntidʒ]	듣기
although
1. 비록…이지만2. …임에도 불구하고3. …이지만
미국 [ɔːlðóu]	듣기 영국 [ɔːlðóu]	듣기
april
4월
미국 [éiprəl]	듣기 영국 [éiprəl]	듣기
annual
1. 연간의2. 연례의3. 매년의4. 연마다의5. 해마다
미국 [ǽnjuəl]	듣기 영국 [ǽnjuəl]	듣기
abroad
1. 해외에2. 외국에3. 널리
미국 [əbrɔ́ːd]	듣기 영국 [əbrɔ́ːd]	듣기
award
1. 상2. 수여하다3. 어워드4. 상금
미국 [əwɔ́ːrd]	듣기 영국 [əwɔ́ːrd]	듣기
agency
1. 기관2. 소속사3. 대행4. 에이전시5. 대리점
미국 [éidʒənsi]	듣기 영국 [éidʒənsi]	듣기
anger
1. 분노2. 화3. 분개4. 노여움
미국 [ǽŋgər]	듣기 영국 [ǽŋgər]	듣기
adjust
1. 조정되다2. 적응하다3. 조절하다4. 감안하다5. 맞추다
미국 [ədʒΛst]	듣기 영국 [ədʒΛst]	듣기
awful
1. 끔찍한2. 엄청난3. 지독한4. 심한5. 이상한
미국 [ɔ́ːfəl]	듣기 영국 [ɔ́ːfəl]	듣기
aboard
1. 타고2. 배로3. 배 위에4. 승선하여5. 기내에
미국 [əbɔ́ːrd]	듣기 영국 [əbɔ́ːrd]	듣기
advertisement
광고
미국 [ӕdvərtáizmənt, ædvə́ːrtismənt]	듣기 영국 [ədvə́ːtismənt]	듣기
addition
1. 추가2. 덧셈3. 등재4. 증축
미국 [ədíʃən]	듣기 영국 [ədíʃən]	듣기
apartment
아파트
미국 [əpάːrtmənt]	듣기 영국 [əpάːrtmənt]	듣기
arrest
1. 체포하다2. 구속하다3. 검거하다4. 억류하다5. 저지하다
미국 [ərést]	듣기 영국 [ərést]	듣기
apologize
1. 사과하다2. 사죄하다3. 죄송하다4. 미안하다
미국 [əpάlədʒàiz]	듣기 영국 [əpɔ́lədʒàiz]	듣기
attractive
1. 매력적인2. 매혹적인
미국 [ətrǽktiv]	듣기 영국 [ətrǽktiv]	듣기
announce
1. 발표하다2. 밝히다3. 알리다4. 공표하다
미국 [ənáuns]	듣기 영국 [ənáuns]	듣기
apart
1. 떨어진2. 분리된3. 분해하는4. 구별되는5. 따로
미국 [əpάːrt]	듣기 영국 [əpάːrt]	듣기
adopt
1. 채택하다2. 입양하다3. 도입하다4. 취하다5. 적용하다
미국 [ədάpt]	듣기 영국 [ədɔ́pt]	듣기
anxiety
1. 불안2. 걱정3. 염려4. 근심5. 긴장
미국 [æŋzáiəti]	듣기 영국 [æŋzáiəti]	듣기
ancient
1. 고대의2. 오래된3. 옛날의
미국 [éinʃənt]	듣기 영국 [éinʃənt]	듣기
afford
1. 여유가 있다2. 할 수 있다
미국 [əfɔ́ːrd]	듣기 영국 [əfɔ́ːrd]	듣기
album
1. 앨범2. 음반
미국 [ǽlbəm]	듣기 영국 [ǽlbəm]	듣기
attract
1. 끌다2. 유치하다3. 유혹하다4. 유인하다
미국 [ətrǽkt]	듣기 영국 [ətrǽkt]	듣기
arrival
1. 도착2. 등장3. 탄생
미국 [əráivəl]	듣기 영국 [əráivəl]	듣기
ahead
1. 앞서2. 앞에3. 미리4. 빠르게
미국 [əhéd]	듣기 영국 [əhéd]	듣기
aggressive
1. 공격적인2. 적극적인3. 활동적인4. 과감한5. 강력한
미국 [əgrésiv]	듣기 영국 [əgrésiv]	듣기
acid
1. 산2. 신3. 신랄한4. LSD
미국 [ǽsid]	듣기 영국 [ǽsid]	듣기
appoint
1. 임명하다2. 지명하다3. 지정하다
미국 [əpɔ́int]	듣기 영국 [əpɔ́int]	듣기
acquire
1. 얻다2. 인수하다3. 갖다4. 배우다5. 구입하다
미국 [əkwáiər]	듣기 영국 [əkwáiər]	듣기
accurate
1. 정확한2. 정밀한3. 올바른4. 일치한5. 적중
미국 [ǽkjurət]	듣기 영국 [ǽkjurət]	듣기
are
1. be의 복수형 및 2인칭·단수·직설법·현재2. 면적의 단위(아르)
미국 [ər, (강) άːr]	듣기 영국 [ər, (강) άːr]	듣기
america
1. 미국2. 아메리카
미국 [əmérikə]	듣기 영국 [əmérikə]	듣기
australia
1. 호주2. 오스트레일리아
미국 [ɔ(ː)stréiljə]	듣기 영국 [ɔ(ː)stréiljə]	듣기
asia
아시아
미국 [éiʒə]	듣기 영국 [éiʃə]	듣기
ate
먹었다
미국 [eit]	듣기 영국 [et, eit]	듣기
adventure
1. 모험2. 어드벤처3. 도전
미국 [ædvénʧər]	듣기 영국 [ədvénʧər]	듣기
author
1. 작가2. 저자3. 필자4. 저술가
미국 [ɔ́ːθər]	듣기 영국 [ɔ́ːθər]	듣기
absent
1. 없는2. 결석한3. 불참한4. 결여된
미국 [ǽbsənt]	듣기 영국 [ǽbsənt]	듣기
artist
1. 예술가2. 아티스트3. 화가4. 미술가5. 가수
미국 [άːrtist]	듣기 영국 [άːrtist]	듣기
ashamed
1. 부끄러워2. 창피한3. 수치스러운
미국 [əʃéimd]	듣기 영국 [əʃéimd]	듣기
administration
1. 정부2. 행정3. 정권4. 관리5. 경영
미국 [ədmìnistréiʃən]	듣기 영국 [ədmìnistréiʃən]	듣기
anyway
1. 어쨌든2. 아무튼3. 어차피4. 그래서5. 결국
미국 [éniwèi, -wèiz]	듣기 영국 [éniwèi, -wèiz]	듣기
association
1. 협회2. 관련3. 연합4. 단체5. 조합
미국 [əsòusiéiʃən, -ʃi-]	듣기 영국 [əsòusiéiʃən, -ʃi-]	듣기
advertise
1. 광고하다2. 홍보하다3. 선전하다4. 알리다
미국 [ǽdvərtàiz]	듣기 영국 [ǽdvərtàiz]	듣기
actual
1. 실제의2. 사실상의3. 진짜의4. 현재의
break
1. 깨다2. 휴식3. 부러지다4. 고장나다5. 중단하다
미국 [breik]	듣기 영국 [breik]	듣기
but
1. ~만2. 하지만3. 그러나4. 아니면5. 뿐만 아니라
미국 [bət; (강) bΛt]	듣기 영국 [bət; (강) bΛt]	듣기
by
…에 의하여
미국 [bai]	듣기 영국 [bai]	듣기
be
1. …이다2. 있다3. 존재하다
미국 [bi; (강) biː]	듣기 영국 [bi; (강) biː]	듣기
back
1. 돌아가다2. 뒤3. 등4. 후퇴하다
미국 [bæk]	듣기 영국 [bæk]	듣기
bed
1. 침대2. …층(層)3. 재우다4. 무덤
미국 [bed]	듣기 영국 [bed]	듣기
burn
1. 타다2. 화상3. 연소하다4. 소비하다5. 굽다
미국 [bəːrn]	듣기 영국 [bəːrn]	듣기
block
1. 블록2. 차단3. 막다4. 구역5. 봉쇄
미국 [blak]	듣기 영국 [blɔk]	듣기
base
1. 기반2. 기초3. 위치하다4. …로 만든5. 기지
미국 [beis]	듣기 영국 [beis]	듣기
board
1. 위원회2. …판3. 이사회4. 보드5. 탑승하다
미국 [bɔːrd]	듣기 영국 [bɔːrd]	듣기
book
1. 책2. 도서3. 서적4. 저서5. 예약하다
미국 [buk]	듣기 영국 [buk]	듣기
big
1. 큰2. 중요한3. 많이4. 대단한
미국 [big]	듣기 영국 [big]	듣기
bad
1. 나쁜2. 좋지 않은3. 잘못된4. 심한5. 상한
미국 [bæd]	듣기 영국 [bæd]	듣기
behind
1. 뒤의2. 숨겨진3. 뒤진4. 늦은5. 등
미국 [biháind, bə-]	듣기 영국 [biháind, bə-]	듣기
best
1. 최고의2. 가장 …한3. 최선의4. 베스트5. 최대의
미국 [best]	듣기 영국 [best]	듣기
business
1. 기업2. 사업3. 경영4. 산업5. 비즈니스
미국 [bíznis]	듣기 영국 [bíznis]	듣기
before
1. 전2. 이전에3. 적4. 앞에
미국 [bifɔ́ːr, bəfɔ́ːr]	듣기 영국 [bifɔ́ːr, bəfɔ́ːr]	듣기
body
1. 몸2. 신체3. 단체4. 시체5. 몸매
미국 [bάdi]	듣기 영국 [bɔ́di]	듣기
buy
1. 사다2. 구입3. 믿다4. 얻다5. 준비하다
미국 [bai]	듣기 영국 [bai]	듣기
believe
1. 믿다2. 생각하다3. 신뢰하다4. 신앙5. 신용하다
미국 [bilíːv, bə-]	듣기 영국 [bilíːv, bə-]	듣기
better
1. 더 나은2. 더 좋은
미국 [bétər]	듣기 영국 [bétər]	듣기
baby
1. 아기2. 새끼3. 어린이용의4. 자기
미국 [béibi]	듣기 영국 [béibi]	듣기
begin
1. 시작하다2. 발생하다3. 착수하다4. 출발하다
미국 [bigín]	듣기 영국 [bigín]	듣기
bread
1. 빵2. 생계
미국 [bred]	듣기 영국 [bred]	듣기
black
1. 검은2. 흑인의3. 블랙의4. 흑
미국 [blæk]	듣기 영국 [blæk]	듣기
below
1. 아래에2. …이하의3. 영하의
미국 [bilóu]	듣기 영국 [bilóu]	듣기
boil
1. 끓이다2. 비등3. 삶다4. 익히다5. 졸이다
미국 [bɔil]	듣기 영국 [bɔil]	듣기
belong
1. 속하다2. …의 것이다3. 소유하다4. 어울리다
미국 [bilɔ́ːŋ, bilάŋ]	듣기 영국 [bilɔ́ŋ]	듣기
bird
1. 새2. 조류
미국 [bəːrd]	듣기 영국 [bəːrd]	듣기
beyond
1. …을 넘어서2. …이상으로3. 뛰어넘는4. …이후5. …이외는
미국 [biάnd, bijάnd]	듣기 영국 [bijɔ́nd, biɔ́nd]	듣기
between
1. 사이에2. …간의3. 둘4. 양측
미국 [bitwíːn, bətwíːn]	듣기 영국 [bitwíːn, bətwíːn]	듣기
box
1. 상자2. 박스3. …함4. 틀5. 권투
미국 [baks]	듣기 영국 [bɔks]	듣기
blue
1. 파란2. 푸른3. 하늘색의4. 블루스5. 우울한
미국 [bluː]	듣기 영국 [bluː]	듣기
bright
1. 밝은2. 영리한3. 빛나는4. 긍정적인5. 환한
미국 [brait]	듣기 영국 [brait]	듣기
bring
1. 가지고 다니다2. 일으키다3. 가져다 주다4. 데려오다5. 생기다
미국 [briŋ]	듣기 영국 [briŋ]	듣기
beautiful
1. 아름다운2. 멋있는3. 훌륭한4. 예쁜5. 화창한
미국 [bjúːtəfəl]	듣기 영국 [bjúːtəfəl]	듣기
busy
1. 바쁜2. 분주한3. 붐비다4. 통화 중인
미국 [bízi]	듣기 영국 [bízi]	듣기
breakfast
1. 아침2. 아침식사3. 조식
미국 [brékfəst]	듣기 영국 [brékfəst]	듣기
building
1. 건물2. 건축3. 빌딩
미국 [bíldiŋ]	듣기 영국 [bíldiŋ]	듣기
boy
1. 소년2. 아이3. 남자4. 학생5. 아들
미국 [bɔi]	듣기 영국 [bɔi]	듣기
bus
1. 버스2. 시내버스
미국 [bʌs]	듣기 영국 [bʌs]	듣기
build
1. 건축하다2. 만들다3. 짓다4. 세우다5. 기르다
미국 [bild]	듣기 영국 [bild]	듣기
both
1. 둘 모두에게2. 두 …3. 양쪽의4. 양자5. 쌍방의
미국 [bouθ]	듣기 영국 [bouθ]	듣기
ball
1. 공2. 볼3. 구기4. 무도회5. 투구
미국 [bɔːl]	듣기 영국 [bɔːl]	듣기
brother
1. 형제2. 동포3. 형씨
미국 [brΛðər]	듣기 영국 [brΛðər]	듣기
born
1. 태어난2. …태생의3. 타고난
미국 [bɔːrn]	듣기 영국 [bɔːrn]	듣기
boat
1. 배2. 보트
미국 [bout]	듣기 영국 [bout]	듣기
bathe
1. 목욕하다2. 감싸다
미국 [beið]	듣기 영국 [beið]	듣기
because
1. …때문에2. 왜냐하면3. …하다고 해서
미국 [bikɔ́ːz, bikΛz]	듣기 영국 [bikɔ́z, bikəz]	듣기
borrow
1. 빌리다2. 대여하다3. 차용하다4. 빚지다
미국 [bάrou]	듣기 영국 [bɔ́rou]	듣기
become
1. …이 되다2. …해지다3. 어울리다
미국 [bikΛm]	듣기 영국 [bikΛm]	듣기
brave
1. 용감한2. 용기3. 무릅쓰다4. 멋진5. 용사
미국 [breiv]	듣기 영국 [breiv]	듣기
beside
1. 곁에2. 가3. 벗어난4. 비교하면
미국 [bisáid]	듣기 영국 [bisáid]	듣기
beat
1. 이기다2. 때리다3. 물리치다4. 비트5. 뛰다
미국 [biːt]	듣기 영국 [biːt]	듣기
bar
1. 바2. 술집3. 막대4. 판매대
미국 [baːr]	듣기 영국 [baːr]	듣기
blow
1. 타격2. 불다3. 울리다
미국 [blou]	듣기 영국 [blou]	듣기
bear
1. 곰2. 부담하다3. 참다4. 맺다
미국 [bεər]	듣기 영국 [bεər]	듣기
bill
1. 법안2. 빌3. 지폐4. 증권5. 청구서
미국 [bil]	듣기 영국 [bil]	듣기
bite
1. 물다2. 한 입3. 물린 곳4. 깨물다5. 물어뜯다
미국 [bait]	듣기 영국 [bait]	듣기
balance
1. 균형2. 안정3. 조화4. 잔고
미국 [bǽləns]	듣기 영국 [bǽləns]	듣기
bound
1. 한계2. 묶인3. 행4. 얽매인5. 의존
미국 [baund]	듣기 영국 [baund]	듣기
burst
1. 터지다2. 터뜨리다3. 폭발하다4. 무너지다5. 분출하다
미국 [bəːrst]	듣기 영국 [bəːrst]	듣기
blood
1. 혈액2. 피3. 혈통4. 혈연5. 유혈
미국 [blʌd]	듣기 영국 [blʌd]	듣기
battle
1. 전투2. 싸움3. 전쟁4. 투쟁5. 대결
미국 [bǽtl]	듣기 영국 [bǽtl]	듣기
blind
1. 시각장애의2. 블라인드3. 맹인의4. 맹목적인5. 장님의
미국 [blaind]	듣기 영국 [blaind]	듣기
budget
1. 예산안2. 예산3. 재정
미국 [bΛdʒit]	듣기 영국 [bΛdʒit]	듣기
billion
1. 10억2. 막대한 수
미국 [bíljən]	듣기 영국 [bíljən]	듣기
bag
1. 가방2. 봉지3. 백4. 주머니5. 봉투
미국 [bæg]	듣기 영국 [bæg]	듣기
bank
1. 은행2. 뱅크3. 강둑
미국 [bæŋk]	듣기 영국 [bæŋk]	듣기
bend
1. 구부러지다2. 휘다3. 숙이다4. 굴절되다5. 굴복시키다
미국 [bend]	듣기 영국 [bend]	듣기
belief
1. 신념2. 믿음3. 생각4. 소신5. 신조
미국 [bilíːf]	듣기 영국 [bilíːf]	듣기
bind
1. 결합하다2. 구속되다3. 묶다4. 속박하다5. 곤경
미국 [baind]	듣기 영국 [baind]	듣기
breath
1. 숨2. 호흡3. 냄새4. 숨결
미국 [breθ]	듣기 영국 [breθ]	듣기
border
1. 국경2. 경계3. 접해 있다4. 인접하다5. 가깝다
미국 [bɔ́ːrdər]	듣기 영국 [bɔ́ːrdər]	듣기
blame
1. 비난하다2. ...탓하다3. 책임4. 나무라다
미국 [bleim]	듣기 영국 [bleim]	듣기
bargain
1. 흥정하다2. 매매 계약3. 헐값4. 싼 물건
미국 [bάːrgən]	듣기 영국 [bάːrgən]	듣기
bottom
1. 바닥2. 아래3. 밑바닥4. 하위5. 최하의
미국 [bάtəm]	듣기 영국 [bɔ́təm]	듣기
broad
1. 넓은2. 광3. 광범위한4. 더욱5. 폭넓은
미국 [brɔːd]	듣기 영국 [brɔːd]	듣기
beginning
1. 시작2. 초3. 처음4. 기원5. 개시
미국 [bigíniŋ]	듣기 영국 [bigíniŋ]	듣기
bottle
1. 병2. 병에 담다3. 우유4. 용기5. 술
미국 [bάtl]	듣기 영국 [bɔ́tl]	듣기
birth
1. 탄생2. 출생3. 태어남4. 출산5. 낳다
미국 [bəːrθ]	듣기 영국 [bəːrθ]	듣기
brush
1. 닦다2. 양치3. 붓4. 빗다5. 브러시
미국 [brʌʃ]	듣기 영국 [brʌʃ]	듣기
behave
1. 행동하다2. 처신하다3. 작용하다
미국 [bihéiv]	듣기 영국 [bihéiv]	듣기
bit
1. 조금2. 약간
미국 [bit]	듣기 영국 [bit]	듣기
belt
1. 벨트2. 허리띠3. 띠4. 지대
cut
1. 삭감하다2. 자르다3. 줄이다4. 중단하다5. 인하하다
미국 [kʌt]	듣기 영국 [kʌt]	듣기
call
1. 부르다2. 전화하다3. 말하다4. 요구하다5. 이름
미국 [kɔːl]	듣기 영국 [kɔːl]	듣기
close
1. 가까운2. 닫다3. 가까이에4. 숨겨진5. 친한
미국 [klouz]	듣기 영국 [klouz]	듣기
carry
1. 휴대하다2. 싣다3. 옮기다4. 운반하다5. 갖다
미국 [kǽri]	듣기 영국 [kǽri]	듣기
card
1. 카드2. …표(票)3. 명함4. 엽서5. 카드놀이
미국 [kaːrd]	듣기 영국 [kaːrd]	듣기
can
1. 할 수 있다2. 캔3. 통조림
미국 [kən; kǽn]	듣기 영국 [kən; kǽn]	듣기
cast
1. 배역2. 주조3. 투표하다4. 던지다5. 드리우다
미국 [kæst]	듣기 영국 [kaːst]	듣기
clear
1. 분명해지다2. 분명한3. 밝아지다4. 명확하다5. 확실히
미국 [kliər]	듣기 영국 [kliər]	듣기
come
1. 오다2. 되다3. 나오다4. 가다5. 일어나다
미국 [kʌm]	듣기 영국 [kʌm]	듣기
case
1. 경우2. 환자3. 사건4. 상자5. 소송
미국 [keis]	듣기 영국 [keis]	듣기
catch
1. 잡다2. 받다3. 걸리다4. 체포하다5. 적발하다
미국 [kæʧ]	듣기 영국 [kæʧ]	듣기
clean
1. 깨끗한2. 청소하다3. 맑은4. 치우다5. 지우다
미국 [kliːn]	듣기 영국 [kliːn]	듣기
color
1. 색2. 색깔3. 색채4. 컬러5. 색상
미국 [kΛlər]	듣기 영국 [kΛlər]	듣기
cover
1. 덮다2. 부담하다3. 가리다4. 표지5. 취재하다
미국 [kΛvər]	듣기 영국 [kΛvər]	듣기
cold
1. 추운2. 차가워진3. 감기4. 추위5. 콜드의
down
1. 내리다2. 지다3. 내려가다4. 넘어져5. 앉다
미국 [daun]	듣기 영국 [daun]	듣기
do
1. 해나가다2. 하다3. 일4. 되어가다5. 들어주다
미국 [du, də; (강) duː]	듣기 영국 [du, də; (강) duː]	듣기
drop
1. 하락2. 떨어지다3. 떨어뜨리다4. 그만두다5. 내리다
미국 [drap]	듣기 영국 [drɔp]	듣기
draw
1. 그리다2. 끌다3. 긋다4. 만들다5. 받다
미국 [drɔː]	듣기 영국 [drɔː]	듣기
drive
1. 운전하다2. 구동하다3. 차로4. 드라이브5. 가다
미국 [draiv]	듣기 영국 [draiv]	듣기
dead
1. 죽은2. 시신3. 사망4. 다 되다5. 돌아가신
미국 [ded]	듣기 영국 [ded]	듣기
dog
1. 개2. 애완견3. 강아지4. 도그5. 개고기
미국 [dɔːg]	듣기 영국 [dɔg]	듣기
dry
1. 건조한2. 말린3. 마른4. 건성의5. 드라이
미국 [drai]	듣기 영국 [drai]	듣기
deep
1. 깊은2. 심3. 매우4. 많다5. 딥
미국 [diːp]	듣기 영국 [diːp]	듣기
dress
1. 입다2. 옷3. 드레스4. 복장5. 변장
미국 [dres]	듣기 영국 [dres]	듣기
date
1. 데이트2. 날짜3. …일4. 시작되다5. 만나다
미국 [deit]	듣기 영국 [deit]	듣기
day
1. 날2. 하루3. 낮4. 데이5. 시절
미국 [dei]	듣기 영국 [dei]	듣기
direct
1. 직접의2. 감독하다3. 연출하다4. 지시하다
미국 [dirékt, dai-]	듣기 영국 [dirékt, dai-]	듣기
die
1. 죽다2. 사망하다3. 사라지다4. 떠나다5. 꺼지다
미국 [dai]	듣기 영국 [dai]	듣기
dream
1. 꿈2. 꿈꾸다3. 드림4. 상상하다5. 희망
end
1. 종료2. 끝나다3. 말4. 결국5. 결과
미국 [end]	듣기 영국 [end]	듣기
even
1. 평평해지다2. 균등해지다3. 백중해지다4. 같은
미국 [íːvən]	듣기 영국 [íːvən]	듣기
eye
1. 눈2. 시선3. 안구4. 쳐다보다5. 눈길
미국 [ai]	듣기 영국 [ai]	듣기
eat
1. 먹다2. 음식3. 먹을 것4. 식5. 식사
미국 [iːt]	듣기 영국 [iːt]	듣기
easy
1. 쉬운2. 좋은3. 편하게4. 용이한5. 수월하게
미국 [íːzi]	듣기 영국 [íːzi]	듣기
excuse
1. 변명2. 핑계3. 참아주다4. 이유5. 구실
미국 [ikskjúːz]	듣기 영국 [ikskjúːz]	듣기
expect
1. 예상하다2. 기대하다3. 생각하다4. 바라다5. 요구하다
미국 [ikspékt]	듣기 영국 [ikspékt]	듣기
example
1. 예2. 본보기3. 사례4. 모범5. 예제
미국 [igzǽmpl]	듣기 영국 [igzάːmpl]	듣기
egg
1. 달걀2. 알3. 난자4. 에그
미국 [eg]	듣기 영국 [eg]	듣기
effect
1. 영향2. 효과3. 발효4. 결과5. 현상
미국 [ifékt]	듣기 영국 [ifékt]	듣기
ever
1. 지금까지2. 이전에3. 항상4. 언제까지나5. 여태까지
미국 [évər]	듣기 영국 [évər]	듣기
exchange
1. 교환2. 환율3. 거래소4. 주고 받다5. 바꾸다
미국 [iksʧéindʒ]	듣기 영국 [iksʧéindʒ]	듣기
equal
1. 평등한2. 동등한3. 같은4. 동일한5. 균등한
미국 [íːkwəl]	듣기 영국 [íːkwəl]	듣기
experience
1. 경험2. 체험3. 겪다4. 느끼다5. 경력
미국 [ikspíəriəns]	듣기 영국 [ikspíəriəns]	듣기
early
1. 초기2. 초3. 일찍4. 이른5. 어린
form
1. 형태2. 형성하다3. 만들다4. 형식5. 종류
미국 [fɔːrm]	듣기 영국 [fɔːrm]	듣기
free
1. 자유의2. 무료의3. …이 없는4. 해방시키다5. 벗어난
미국 [friː]	듣기 영국 [friː]	듣기
fly
1. 날다2. 비행하다3. 파리4. 빠르다5. 비행기를 타다
미국 [flai]	듣기 영국 [flai]	듣기
fall
1. 떨어지다2. 가을3. 감소하다4. 하락하다5. 폭포
미국 [fɔːl]	듣기 영국 [fɔːl]	듣기
for
1. …을 위하여2. …을 기념하여3. …용의
미국 [fər; fɔ́ːr]	듣기 영국 [fər; fɔ́ːr]	듣기
field
1. 분야2. 현장3. 들판4. 경기장5. …장(場)
미국 [fiːld]	듣기 영국 [fiːld]	듣기
fix
1. 고치다2. 고정하다3. 해결하다4. 음식을 준비하다5. 정하다
미국 [fiks]	듣기 영국 [fiks]	듣기
fine
1. 좋은2. 벌금3. 미세한4. 잘5. 고급의
미국 [fain]	듣기 영국 [fain]	듣기
front
1. 앞2. 전선3. 면4. 앞면5. 프런트
미국 [frʌnt]	듣기 영국 [frʌnt]	듣기
figure
1. 수치2. 인물3. 생각하다4. 피겨5. 인형
미국 [fígjər]	듣기 영국 [fígə]	듣기
fire
1. 화재2. 불3. 발사하다4. 소방의5. 해고하다
미국 [faiər]	듣기 영국 [faiər]	듣기
face
1. 얼굴2. 직면하다3. 표정
미국 [feis]	듣기 영국 [feis]	듣기
force
1. 강요하다2. 군대3. 힘4. 세력5. 효력
미국 [fɔːrs]	듣기 영국 [fɔːrs]	듣기
first
1. 첫2. 처음의3. 최초4. 먼저5. 우선
미국 [fəːrst]	듣기 영국 [fəːrst]	듣기
fit
1. 꼭 맞는2. 부합3. 어울리는4. 건강한5. 착용
미국 [fit]	듣기 영국 [fit]	듣기
fast
1. 빨리2. 빠른3. 단식하다4. 단식일5. 깊게
미국 [fæst]	듣기 영국 [faːst]	듣기
full
1. 가득한2. 완전한3. 전체4. 본격적인5. 많은
미국 [ful]	듣기 영국 [ful]	듣기
find
1. 찾다2. 발견하다3. 알다4. 알아보다
미국 [faind]	듣기 영국 [faind]	듣기
feel
1. 느끼다2. 기분3. 감정
미국 [fiːl]	듣기 영국 [fiːl]	듣기
flow
1. 유동2. 흐름3. 몰입4. 유입5. 플로우
미국 [flou]	듣기 영국 [flou]	듣기
from
1. …에서2. …으로부터3. …부터
미국 [frəm; (강) frΛm, frάm]	듣기 영국 [frɔ́m]	듣기
flower
1. 꽃2. 꽃을 피우다
미국 [fláuər]	듣기 영국 [fláuər]	듣기
friend
1. 친구2. 프랜드3. 벗4. 동창
미국 [frend]	듣기 영국 [frend]	듣기
fight
1. 싸우다2. 싸움3. 맞서다4. 전투5. 이기다
미국 [fait]	듣기 영국 [fait]	듣기
fear
1. 두려움2. 공포3. 우려4. 걱정하다5. 불안
go
1. 가다2. 계속하다3. 떠나다4. 출발하다
미국 [gou]	듣기 영국 [gou]	듣기
get
1. 받다2. 얻다3. 가지다4. …시키다5. 알아듣다
미국 [get]	듣기 영국 [get]	듣기
good
1. 좋은2. 잘3. 훌륭한4. 착한5. 괜찮은
미국 [gud]	듣기 영국 [gud]	듣기
great
1. 위대한2. 큰3. 훌륭한4. 좋은5. 많은
미국 [greit]	듣기 영국 [greit]	듣기
ground
1. 지상의2. 땅3. 기반4. 영역5. 기본의
미국 [graund]	듣기 영국 [graund]	듣기
give
1. 주다2. 전하다3. 제공하다4. 기부하다5. 수여하다
미국 [giv]	듣기 영국 [giv]	듣기
game
1. 게임2. 경기3. 시합
미국 [geim]	듣기 영국 [geim]	듣기
glass
1. 유리2. 안경3. 잔4. 컵5. 렌즈
미국 [glæs]	듣기 영국 [glaːs]	듣기
group
1. 그룹2. 단체3. 집단4. 무리
미국 [gruːp]	듣기 영국 [gruːp]	듣기
grow
1. 성장하다2. 자라다3. 크다4. 증가하다5. 늘다
미국 [grou]	듣기 영국 [grou]	듣기
guess
1. …인 것 같다2. …라고 생각하다3. 추측하다4. 맞히다5. 짐작하다
미국 [ges]	듣기 영국 [ges]	듣기
gain
1. 얻다2. 증가하다3. 이익4. 획득하다5. 달성하다
미국 [gein]	듣기 영국 [gein]	듣기
god
1. 신2. 하느님3. 세상에4. 우상
미국 [gad]	듣기 영국 [gɔd]	듣기
garden
1. 정원2. 가든3. 원예를 하다
미국 [gάːrdn]	듣기 영국 [gάːrdn]	듣기
green
1. 녹색의2. 환경 친화적인3. 푸른4. 잔디5. 야채의
미국 [griːn]	듣기 영국 [griːn]	듣기
glad
1. 기쁜2. 좋은3. 다행인4. 고마운5. 반가운
미국 [glæd]	듣기 영국 [glæd]	듣기
girl
1. 소녀2. 여자아이3. 여학생4. 미혼여성5. 딸
미국 [gəːrl]	듣기 영국 [gəːrl]	듣기
gun
1. 총2. 무기3. 포4. 거물
미국 [gʌn]	듣기 영국 [gʌn]	듣기
grass
1. 풀2. 잔디3. 목장
미국 [græs]	듣기 영국 [graːs]	듣기
goods
1. 상품2. 물품3. 물건4. 재화5. 물자
미국 [gudz]	듣기 영국 [gudz]	듣기
gather
1. 모이다2. 수집하다3. 받다4. 모임5. 모여들다
미국 [gǽðər]	듣기 영국 [gǽðər]	듣기
guard
1. 경비원2. 보호하다3. 경계4. 가드5. 막다
미국 [gaːrd]	듣기 영국 [gaːrd]	듣기
guide
1. 가이드2. 안내하다3. 유도하다4. 지도하다5. 인도하다
미국 [gaid]	듣기 영국 [gaid]	듣기
growth
1. 성장2. 증가3. 상승4. 자람5. 증대
미국 [grouθ]	듣기 영국 [grouθ]	듣기
general
1. 일반의2. 장군3. 전반적인4. 장관의5. 보통의
head
1. 머리2. 지도자
미국 [hed]	듣기 영국 [hed]	듣기
have
1. 가지다2. 얻다3. 걸리다4. 낳다5. 소유하다
미국 [həv, əv, ; hǽv]	듣기 영국 [həv, əv, ; hǽv]	듣기
high
1. 높은2. 많은3. 첨단의4. 큰5. 비싼
미국 [hai]	듣기 영국 [hai]	듣기
heavy
1. 중(重)…2. 무거운3. 강력한4. 과중한5. 심한
미국 [hévi]	듣기 영국 [hévi]	듣기
hold
1. 열다2. 보유하다3. 잡다4. 기다리다
미국 [hould]	듣기 영국 [hould]	듣기
hand
1. 손2. 주다3. 도움4. 박수5. 맡기다
미국 [hænd]	듣기 영국 [hænd]	듣기
hard
1. 열심히2. 어려운3. 힘든4. 강경한5. 고생
미국 [haːrd]	듣기 영국 [haːrd]	듣기
home
1. 집2. 가정의3. 홈4. 고향의5. 주택
미국 [houm]	듣기 영국 [houm]	듣기
hang
1. 걸다2. 달다3. 교수형에 처하다4. 요령5. 견디다
미국 [hæŋ]	듣기 영국 [hæŋ]	듣기
hot
1. 더운2. 뜨거운3. 매운4. 인기 있는5. 잘하는
미국 [hat]	듣기 영국 [hɔt]	듣기
house
1. 집2. 주택3. 하우스4. 의회5. 가정의
미국 [haus]	듣기 영국 [haus]	듣기
hit
1. 치다2. 히트를 치다3. 타격4. 달하다5. 명중하다
미국 [hit]	듣기 영국 [hit]	듣기
help
1. 돕다2. 도움3. 도와주다4. 기여하다
미국 [help]	듣기 영국 [help]	듣기
heat
1. 열2. 가열하다3. 난방4. 뜨거워지다5. 더위
미국 [hiːt]	듣기 영국 [hiːt]	듣기
how
1. 어떻게2. 얼마나3. 방법4. 몇5. 정말
in
1. …안에2. …으로3. …에
미국 [in, ən; ín]	듣기 영국 [in, ən; ín]	듣기
issue
1. 문제2. 쟁점3. 이슈4. 사안5. 발행하다
미국 [íʃuː]	듣기 영국 [íʃuː]	듣기
it
1. 그것2. 이것3. 그런
미국 [it]	듣기 영국 [it]	듣기
ill
1. 아픈2. 나쁜3. 잘못된4. 좋지 않은5. 고생하다
미국 [il]	듣기 영국 [il]	듣기
interest
1. 관심2. 이자3. 이해관계
미국 [íntərəst, -tərèst]	듣기 영국 [íntərəst, -tərèst]	듣기
information
1. 정보2. 자료3. 뉴스4. 안내5. 보도
미국 [ìnfərméiʃən]	듣기 영국 [ìnfərméiʃən]	듣기
idea
1. 생각2. 아이디어3. 방법4. 개념5. 사상
미국 [aidíːə]	듣기 영국 [aidíə]	듣기
image
1. 이미지2. 영상3. 사진4. 인상5. 모습
미국 [ímidʒ]	듣기 영국 [ímidʒ]	듣기
if
1. 만약2. …라면3. 만일
미국 [if]	듣기 영국 [if]	듣기
into
1. 들어가다2. 속으로3. 안으로4. 빠져 있다
미국 [(자음 앞) ìntə (모음 앞) ìntu; (강) ínt]	듣기 영국 [(자음 앞) ìntə (모음 앞) ìntu; (강) ínt]	듣기
industry
1. 산업2. 업계3. 제조업4. 공업
미국 [índəstri]	듣기 영국 [índəstri]	듣기
introduce
1. 소개하다2. 도입하다3. 선보이다4. 제출하다5. 발표하다
미국 [ìntrədjúːs]	듣기 영국 [ìntrədjúːs]	듣기
invite
1. 초대하다2. 초청하다3. 부르다4. 권하다5. 초래하다
미국 [inváit]	듣기 영국 [inváit]	듣기
intend
1. 의도하다2. 계획하다3. 하려고 하는4. 의미하다
미국 [inténd]	듣기 영국 [inténd]	듣기
imagine
1. 상상하다2. 생각하다3. 짐작하다
미국 [imǽdʒin]	듣기 영국 [imǽdʒin]	듣기
indeed
1. 정말로2. 사실은
미국 [indíːd]	듣기 영국 [indíːd]	듣기
important
1. 중요한2. 주요한3. 중대한4. 소중한
미국 [impɔ́ːrtənt]	듣기 영국 [impɔ́ːrtənt]	듣기
interesting
1. 흥미로운2. 재미있는3. 놀라운
미국 [íntərəstiŋ, -tərèst-]	듣기 영국 [íntərəstiŋ, -tərèst-]	듣기
increase
1. 증가하다2. 늘리다3. 인상되다4. 확대하다5. 상승하다
미국 [inkríːs]	듣기 영국 [inkríːs]	듣기
influence
1. 영향2. 요인3. 변화4. 결과5. 작용
미국 [ínfluəns]	듣기 영국 [ínfluəns]	듣기
import
1. 수입하다2. 중요하다3. 들여오다
미국 [impɔ́ːrt]	듣기 영국 [impɔ́ːrt]	듣기
insurance
1. 보험2. 보험금
미국 [inʃúərəns]	듣기 영국 [inʃúərəns]	듣기
imagination
1. 상상2. 창의성3. 착각
미국 [imӕdʒənéiʃən]	듣기 영국 [imӕdʒənéiʃən]	듣기
incident
1. 사건2. 사고3. 사태4. 사변
미국 [ínsədənt]	듣기 영국 [ínsədənt]	듣기
improve
1. 개선하다2. 향상하다3. 증진시키다4. 높아지다5. 나아지다
jump
1. 점프2. 증가하다3. 뛰다4. 뛰어들다5. 오르다
미국 [dʒʌmp]	듣기 영국 [dʒʌmp]	듣기
just
1. 것만 2. 그냥3. 단지4. 그저5. 방금
미국 [dʒʌst]	듣기 영국 [dʒʌst]	듣기
job
1. 직무2. 일3. 직업4. 일자리5. 수술
미국 [dʒab]	듣기 영국 [dʒɔb]	듣기
join
1. 참여하다2. 가입하다3. 합치다4. 잇다5. 만나다
미국 [dʒɔin]	듣기 영국 [dʒɔin]	듣기
joy
1. 기쁨2. 즐거움3. 행복4. 환희5. 만족
미국 [dʒɔi]	듣기 영국 [dʒɔi]	듣기
judge
1. 판사2. 판단하다3. 심사하다4. 평가하다5. 판결하다
미국 [dʒʌdʒ]	듣기 영국 [dʒʌdʒ]	듣기
japanese
1. 일본의2. 일본인3. 일본어4. 일본식
미국 [dʒӕpəníːz]	듣기 영국 [dʒӕpəníːz]	듣기
joke
1. 농담2. 장난3. 놀리다4. 재담
미국 [dʒouk]	듣기 영국 [dʒouk]	듣기
justice
1. 정의2. 사법3. 공정4. 재판5. 판사
미국 [dʒΛstis]	듣기 영국 [dʒΛstis]	듣기
jam
1. 잼2. 채워넣은3. 방해하다4. 막히는5. 즉흥적인
미국 [dʒæm]	듣기 영국 [dʒæm]	듣기
june
6월
미국 [dʒuːn]	듣기 영국 [dʒuːn]	듣기
journey
1. 여행2. 여정3. 길4. 항해5. 행로
미국 [dʒə́ːrni]	듣기 영국 [dʒə́ːrni]	듣기
joint
1. 공동의2. 관절3. 합동의4. 합작의5. 조인트
미국 [dʒɔint]	듣기 영국 [dʒɔint]	듣기
jaw
1. 턱2. 입3. 수다
미국 [dʒɔː]	듣기 영국 [dʒɔː]	듣기
jar
1. 병2. 항아리3. 단지
미국 [dʒaːr]	듣기 영국 [dʒaːr]	듣기
junior
1. 주니어2. 2학년인3. 1학년인4. 3학년인5. 후배
미국 [dʒúːnjər]	듣기 영국 [dʒúːnjər]	듣기
jealous
1. 질투하는2. 시기하는3. 부러워하는4. 탐내는
미국 [dʒéləs]	듣기 영국 [dʒéləs]	듣기
juice
1. 주스2. 즙3. 힘
미국 [dʒuːs]	듣기 영국 [dʒuːs]	듣기
japan
일본
미국 [dʒəpǽn]	듣기 영국 [dʒəpǽn]	듣기
january
1월
미국 [dʒǽnjuèri]	듣기 영국 [dʒǽnjuəri]	듣기
jewel
1. 보석광물2. 보석3. 보배
미국 [dʒúːəl]	듣기 영국 [dʒúːəl]	듣기
jolly
1. 유쾌한2. 즐거운3. 매우4. 비위를 맞추다
미국 [dʒάli]	듣기 영국 [dʒɔ́li]	듣기
journalism
1. 언론계2. 저널리즘3. 신문 잡지
미국 [dʒə́ːrnəlìzm]	듣기 영국 [dʒə́ːrnəlìzm]	듣기
judgment
1. 판단2. 심판3. 판결4. 결정5. 평가
미국 [dʒΛdʒmənt]	듣기 영국 [dʒΛdʒmənt]	듣기
jacket
1. 재킷2. 상의3. 조끼4. 표지
kick
1. 차다2. 킥3. 발길질4. 끊다5. 쏘는 맛
미국 [kik]	듣기 영국 [kik]	듣기
keep
1. 유지하다2. 계속하다3. …인 상태를 지키다4. 기르다5. 간직하다
미국 [kiːp]	듣기 영국 [kiːp]	듣기
kind
1. 종류2. …가지3. 친절한4. 부드러운5. 착한
미국 [kaind]	듣기 영국 [kaind]	듣기
know
1. 알다2. 알려져 3. 인식하다
미국 [nou]	듣기 영국 [nou]	듣기
kill
1. 죽이다2. 살해하다3. 사망하다4. 목숨을 앗아가다5. 자살하다
미국 [kil]	듣기 영국 [kil]	듣기
kitchen
1. 부엌2. 주방
미국 [kíʧən]	듣기 영국 [kíʧən]	듣기
key
1. 핵심2. 중요한3. 주요한4. 열쇠5. 키
미국 [kiː]	듣기 영국 [kiː]	듣기
knowledge
1. 지식2. 아는 것3. 인지4. 학식
미국 [nάlidʒ]	듣기 영국 [nɔ́lidʒ]	듣기
kiss
1. 키스2. 입맞춤3. 뽀뽀
미국 [kis]	듣기 영국 [kis]	듣기
knock
1. 두드리다2. 노크하다3. 때리기4. 충돌시키다5. 녹
미국 [nak]	듣기 영국 [nɔk]	듣기
knife
1. 칼2. 나이프3. 흉기4. 부엌칼5. 식칼
미국 [naif]	듣기 영국 [naif]	듣기
king
1. 왕2. 킹3. 국왕4. 황제5. 최고
미국 [kiŋ]	듣기 영국 [kiŋ]	듣기
knee
1. 무릎2. 슬관절
미국 [niː]	듣기 영국 [niː]	듣기
kid
1. 아이2. 어린이3. 놀리다4. 아들5. 농담하다
미국 [kid]	듣기 영국 [kid]	듣기
knot
1. 매듭2. 노트3. 난제
line
1. 선2. 라인3. 노선4. 줄을 서다5. 전화
미국 [lain]	듣기 영국 [lain]	듣기
light
1. 빛2. 밝게하다3. 조명4. 광선5. 가벼운
미국 [lait]	듣기 영국 [lait]	듣기
like
1. …같은2. 좋아하다3. …하고 싶은4. 마치5. 마찬가지로
미국 [laik]	듣기 영국 [laik]	듣기
long
1. 긴2. 오래3. 오랫동안4. 오랜5. 장거리의
미국 [lɔːŋ]	듣기 영국 [lɔŋ]	듣기
lead
1. 이끌다2. 주도권3. 앞서다4. 선두5. 납
미국 [liːd]	듣기 영국 [liːd]	듣기
low
1. 낮은2. 저3. 최저의4. 적은5. 떨어지는
미국 [lou]	듣기 영국 [lou]	듣기
lay
1. 낳다2. 눕다3. 놓다4. 마련하다5. 쌓다
미국 [lei]	듣기 영국 [lei]	듣기
land
1. 땅2. 토지3. 착륙하다4. 지역5. 국토
미국 [lænd]	듣기 영국 [lænd]	듣기
live
1. 살다2. 생활하다3. 거주하다4. 생방송의5. 생존하다
미국 [liv]	듣기 영국 [liv]	듣기
law
1. 법2. 법률3. 법칙4. 법안5. 규정
미국 [lɔː]	듣기 영국 [lɔː]	듣기
little
1. 작은2. 조금3. 좀4. 약간의5. 어린
미국 [lítl]	듣기 영국 [lítl]	듣기
lie
1. 거짓말2. 눕다3. 놓여 있다4. 속이다5. 존재하다
미국 [lai]	듣기 영국 [lai]	듣기
life
1. 삶2. 생명3. 생활4. 인생5. 평생의
미국 [laif]	듣기 영국 [laif]	듣기
level
1. 수준2. 정도3. 레벨4. …급5. 높이
미국 [lévəl]	듣기 영국 [lévəl]	듣기
load
1. 무게2. 부담량3. 싣다4. 로딩5. 짐
미국 [loud]	듣기 영국 [loud]	듣기
love
1. 사랑하다2. 좋아하다3. 러브4. 애정5. 연애
미국 [lʌv]	듣기 영국 [lʌv]	듣기
leave
1. 떠나다2. 남기다3. 맡기다4. 출발하다
미국 [liːv]	듣기 영국 [liːv]	듣기
lose
1. 잃다2. 지다3. 길을 잃다4. 감소하다5. 상실하다
미국 [luːz]	듣기 영국 [luːz]	듣기
letter
1. 편지2. 글자3. 문서4. …장(狀)
미국 [létər]	듣기 영국 [létər]	듣기
look
1. 보다2. 찾다3. 표정4. 바라보다5. 살펴보다
미국 [luk]	듣기 영국 [luk]	듣기
late
1. 말기의2. 늦은3. 늦도록4. 늦게5. 최근의
미국 [leit]	듣기 영국 [leit]	듣기
laugh
1. 웃다2. 웃음3. 비웃다4. 재미있어하다
미국 [læf]	듣기 영국 [laːf]	듣기
language
1. 언어2. ...어3. 말4. 어학5. 용어
미국 [lǽŋgwidʒ]	듣기 영국 [lǽŋgwidʒ]	듣기
large
1. 큰2. 대규모의3. 많은4. 거대한5. 커다란
미국 [laːrdʒ]	듣기 영국 [laːrdʒ]	듣기
let
1. …하게 해주다2. …하도록 두다3. 들여보내다4. 방치하다5. 세놓다



'''
lists = parser.split("듣기")


import re

for k in range(0,len(lists),2):
    i = lists[k]
    start = i.find("미국")
    i = i[:start]
    i = i.strip()
    i = i.split("\n")
    eng = i[0]
    eng = eng.strip()
    kor = i[1]
    kor = kor.strip()
    kors = re.sub("\d. ","\n",kor)
    kors = kors.strip()
    kors = kors.replace("\n","\\n")
    eng = eng.strip()
    
    print("Data.add(new Word(\""+kors+"\",\""+eng+"\"));" )
 
